tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Modern replacement for 'ls'
brew "exa"
# General-purpose data compression with high compression ratio
brew "xz"
# GNU compiler collection
brew "gcc"
# Package for scientific computing with Python
brew "numpy"
# Geospatial Data Abstraction Library
brew "gdal"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Improved top (interactive process viewer)
brew "htop"
# Run local Kubernetes cluster in Docker
brew "kind"
# Implementation of the file(1) command
brew "libmagic"
# Mac App Store command-line interface
brew "mas"
# Fast, highly customisable system info script
brew "neofetch"
# Manage multiple Node.js versions
brew "nvm"
# Password manager
brew "pass"
# Object-relational database system
brew "postgresql@14"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# General-purpose lossless data-compression library
brew "zlib"
# App to build and share containerized applications and microservices
cask "docker"
# Web browser
cask "google-chrome"
# Open-source screen recorder built with web technology
cask "kap"
# End-to-end encryption software
cask "keybase"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Move and resize windows with ease
cask "spectacle"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "Telegram", id: 747648890
mas "WireGuard", id: 1451685025
