tap "homebrew/bundle"
tap "homebrew/services"
tap "lencx/chatgpt", "https://github.com/lencx/ChatGPT.git"
# Run your GitHub Actions locally
brew "act"
# General-purpose data compression with high compression ratio
brew "xz"
# Next generation open source RPC library and framework
brew "grpc"
# Columnar in-memory analytics layer designed to accelerate big data
brew "apache-arrow"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Modern replacement for 'ls'
brew "exa"
# GNU compiler collection
brew "gcc"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Postgres C API library
brew "libpq"
# Package for scientific computing with Python
brew "numpy"
# Geospatial Data Abstraction Library
brew "gdal"
# Next generation open source RPC library and framework
brew "grpc@1.54"
# Improved top (interactive process viewer)
brew "htop"
# Run local Kubernetes cluster in Docker
brew "kind"
# Implementation of the file(1) command
brew "libmagic"
# Mac App Store command-line interface
brew "mas"
# Fast, highly customisable system info script
brew "neofetch"
# Manage multiple Node.js versions
brew "nvm"
# Python dependency management tool
brew "pipenv"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Object-relational database system
brew "postgresql@14"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# JavaScript package manager
brew "yarn"
# General-purpose lossless data-compression library
brew "zlib"
# Chromium based browser
cask "arc"
# Virtual Audio Driver
cask "blackhole-2ch"
# Desktop wrapper for OpenAI ChatGPT
cask "chatgpt"
# App to build and share containerized applications and microservices
cask "docker"
# Reimagine your terminal
cask "fig"
# Web browser
cask "google-chrome"
# Desktop automation application
cask "hammerspoon"
# Open-source screen recorder built with web technology
cask "kap"
# End-to-end encryption software
cask "keybase"
# File system integration
cask "macfuse"
# App to write, plan, collaborate, and get organized
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Collaboration platform for API development
cask "postman"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Open-source BitTorrent client
cask "transmission"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
mas "Amphetamine", id: 937984704
mas "Numbers", id: 409203825
mas "Slack", id: 803453959
mas "Telegram", id: 747648890
mas "WireGuard", id: 1451685025
vscode "alefragnani.project-manager"
vscode "be5invis.toml"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "esbenp.prettier-vscode"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.github-vscode-theme"
vscode "gitpod.gitpod-desktop"
vscode "Gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "JuanBlanco.solidity"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "NomicFoundation.hardhat-solidity"
vscode "redhat.vscode-yaml"
vscode "tldraw-org.tldraw-vscode"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "WakaTime.vscode-wakatime"
vscode "withfig.fig"
